takafuminaka/nRF52832/i2s_ws2812b_demostration_planB/i2s_ws2812b_driver/ws2812b_driver.h
/* Copyright (c) 2016 Takafumi Naka. All Rights Reserved.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#ifndef WS2812B_DRIVER_H__
#define WS2812B_DRIVER_H__

#include <stdio.h>
#include "nrf_drv_i2s.h"
#include "stdlib.h"
#include "app_error.h"
#include "app_util_platform.h"
#include "bsp.h"


#define PATTERN_0 ((uint8_t)0x08)			// Bit pattern for data "0" is "HLLL".
#define PATTERN_1 ((uint8_t)0x0e)      // Bit pattern for data "1" is "HHHL".
#define	BUF_SIZE_PER_LED	(12)	// buffer size for each LED (8bit * 4 * 3 )

typedef struct
{
    uint8_t   green; // Brightness of green (0 to 255)
    uint8_t   red;   // Brightness of red   (0 to 255)
    uint8_t   blue;  // Brightness of blue  (0 to 255)
} rgb_led_t;

typedef struct
{
		uint8_t* buff; // data buffer
		uint16_t length; // buffer size
} xfer_buffer_t;

void alloc_xfer_buffer(xfer_buffer_t * xfer_buffer, uint16_t num_leds);

void set_blank(rgb_led_t * rgb_led, uint16_t num_leds);

void set_buff(rgb_led_t* rgb_led, xfer_buffer_t xfer_buffer);

void ws2812b_driver_current_cap(rgb_led_t * led_array, uint16_t num_leds, uint32_t limit);

void ws2812b_driver_dim(rgb_led_t * led_array, uint16_t num_leds, float dim );

uint32_t ws2812b_driver_calc_current(rgb_led_t * led_array, uint16_t num_leds);


#endif // WS2812B_DRIVER_H__
